START_GAME_COMMAND = "🦉 Начать игру 🦉"
GET_INFO_COMMAND = "🧐 Как играть? 🧐"
CHOOSE_ANSWERING_COMMAND = "😎 Выбрать отвечающего 😎"
STOP_GAME_COMMAND = "🛑 Остановить игру 🛑"
GREETING_TEXT = """Привет! Я бот для игры в "Что?Где?Когда? 🦉\n
Для корректной работы игры мне нужны права администратора.\n
Предоставьте их и можно начинать играть."""
INFO_TEXT = """Вы - команда знатоков! \n \
Наконец-то эта игра сможет познать всю мощь человеческого интеллекта!\n
Где-то господин Друзь и господин Поташев уже немного занервничали, ведь сегодня их могут превзойти.\n
Бот случайным образом выберет игроков и капитана, и именно капитан будет решать, 
кто же из игроков будет давать ответ на вопрос.\n
Капитан также сможет прервать игру в любой момент.\n
And let the game begin!!\n
Бот будет задавать вам вопросы. 
На прочтение вопроса даётся 15 секунд, далее игрокам даётся минута на размышление.\n
По окончании минуты у капитана появится возможность выбрать игрока, который будет отвечать на вопрос. \n
Выбранный игрок пишет ответ.\n
Пишите внимательно, бот умный, но не то чтобы очень, опечатки сыграют с вами злую шутку...\n
Далее бот напишет правильный ответ и присудит балл знатокам или зрителям.\n
Побеждает команда, которая наберёт 6 очков."""
ASK_FOR_RIGHTS = """Сейчас у меня нет прав администратора. 😒 \n
Без них я не смогу провести игру \n
Они нужны для доступа к списку участников.\n
Предоставьте их, пожалуйста 🙏"""
INFO_ABOUT_TEAM_SIZE = "Сейчас в чате более 6 человек онлайн. \
Из них будут случайным образом выбрана команда и капитан."
QUESTIONS_NEEDED = 11
MAX_PLAYERS_IN_TEAM = 6
START_COMMAND = "/start"
CAP_BUTTONS_COMMENT = "Эти 👇 кнопки для капитана"
STRANGE_NUM_FROM_VK = 2000000000
